{
  "architectures": [
    "MixtralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 2,
  "eos_token_id": 0,
  "hidden_act": "silu",
  "hidden_size": 512,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "max_position_embeddings": 8192,
  "model_type": "mixtral",
  "num_attention_heads": 8,
  "num_hidden_layers": 6,
  "num_key_value_heads": 4,
  "num_local_experts": 4,
  "num_experts_per_tok": 2,
  "output_router_logits": false,
  "pad_token_id": 1,
  "rms_norm_eps": 1e-05,
  "rope_theta": 500000.0,
  "router_aux_loss_coef": 0.0,
  "router_jitter_noise": 0.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.0.dev0",
  "use_cache": true,
  "vocab_size": 256
}
