{
  "backend": "tokenizers",
  "bos_token": "<cls>",
  "clean_up_tokenization_spaces": false,
  "cls_token": "<cls>",
  "eos_token": "<eos>",
  "is_local": true,
  "mask_token": "<mask>",
  "model_input_names": [
    "input_ids",
    "attention_mask"
  ],
  "model_max_length": 1000000000000000019884624838656,
  "model_specific_special_tokens": {},
  "pad_token": "<pad>",
  "tokenizer_class": "TokenizersBackend",
  "unk_token": "<unk>"
}
